artillery.yaml
config:
  target: http://127.0.0.1:8080
  processor: "./artillery.js"
  phases:
    - duration: 10
      arrivalRate: 10
    - duration: 10
      arrivalRate: 20
    - duration: 10
      arrivalRate: 50
    - duration: 10
      arrivalRate: 100
    - duration: 10
      arrivalRate: 200
    - duration: 60
      arrivalRate: 500
scenarios:
  - name: Create account + Auth + Sum
    flow:
      - function: generateRandomData
      - post:
          url: /account
          json:
            name: "{{ name }}"
            password: "{{ password }}"
      - get:
          url: /account/login
          headers:
            Authorization: Basic {{ basic }}
          capture:
            json: $.token
            as: bearer
      - get:
          url: /sum?value1={{ value1 }}&value2={{ value2 }}
          headers:
            Authorization: Bearer {{ bearer }}
          capture:
            json: $.result
            as: result
      #- log: "{{ value1 }} + {{ value2 }} = {{ result }}"